// 연속된 부분 수열의 합

function SumOfSuccessive(seq, k) {
  return;
}

SumOfSuccessive([1, 2, 3, 4, 5], 7); // [2,3]
// [1, 2, 3, 4, 5]에서 합이 7인 연속된 부분 수열은 [3, 4]뿐이므로 해당 수열의 시작 인덱스인 2와 마지막 인덱스 3을 배열에 담아 [2, 3]을 반환합니다.
SumOfSuccessive([1, 1, 1, 2, 3, 4, 5], 5); // [6,6]
// [1, 1, 1, 2, 3, 4, 5]에서 합이 5인 연속된 부분 수열은 [1, 1, 1, 2], [2, 3], [5]가 있습니다. 이 중 [5]의 길이가 제일 짧으므로 해당 수열의 시작 인덱스와 마지막 인덱스를 담은 [6, 6]을 반환합니다.
SumOfSuccessive([2, 2, 2, 2, 2], 6); // [0,2]
// [2, 2, 2, 2, 2]에서 합이 6인 연속된 부분 수열은 [2, 2, 2]로 3가지 경우가 있는데, 길이가 짧은 수열이 여러 개인 경우 앞쪽에 나온 수열을 찾으므로 [0, 2]를 반환합니다.
